{
  "fakeJobs":[
    {
      "companyLocation":"Hybrid remote in San Francisco, CA 94118",
      "companyName":"Example Company",
      "jobDescriptionArr":[
        "We're building the future of pet care, combining insights, products, and services to help ",
        "people be the best pet parents they can be - and to ultimately create a better world for ",
        "pets. OUR TEAM  Example company is the industry leading SaaS platform for pet boarding ",
        "and daycare. We are looking for a great developer to work with us as we take Example company to ",
        "the next level. As part of the Example company engineering team, you will join a group that cares ",
        "about writing clean code, collaborating, taking ownership of their work, and being ",
        "open-minded to learning new technologies. Your ideas, design and code will make a real ",
        "difference in the growing field of pet care technology. This is an exciting time to join ",
        "Example company as we scale out our products and create the pet care platform of the ",
        "future. We are looking for a great developer who is proficient with React.js and React ",
        "Native. Your primary focus will be on developing user interface components and ",
        "implementing them following well-known React.js workflows (such as Flux or Redux). You ",
        "will ensure that these components and the overall application are robust, testable and ",
        "easy to maintain. You will coordinate with the rest of the team working on different ",
        "layers of the infrastructure. Therefore, a commitment to collaborative problem solving, ",
        "sophisticated design, and quality product is important.  RESPONSIBILITIES:  Developing ",
        "new user-facing features using React.js Building reusable components and front-end ",
        "libraries for future use Translating designs and wireframes into high quality code ",
        "Optimizing components for maximum performance across a vast array of web-capable devices ",
        "and browsers Integrate with RESTful APIs."],
      "jobLink":"#",
      "jobTitle":"Software Engineer",
      "salary":"$150,000 - $180,000 a year",
      "skills":[
        "JavaScript",
        "PHP",
        "HTML",
        "React"
      ]
    }, 
    {
      "companyLocation":"Seattle, WA",
      "companyName":"Example Company 2",
      "jobDescriptionArr":[
        "Role Number: 200405446 Play a part in the next revolution in human-computer interaction. ",
        "Contribute to the product that is redefining mobile computing through voice interaction. ",
        "You will help create groundbreaking technology for large scale systems, spoken language, ",
        "big data, and artificial intelligence. And work with the people who created the always-on ",
        "always learning best in class intelligent voice assistant that helps millions of people ",
        "get things done. Our team is looking for a machine learning engineer to develop and ",
        "advance frictionless voice invocation experience on our innovative devices enabling ",
        "compelling new conversational features. You should be eager to do hands-on work to ",
        "improve and build features to improve overall capabilities. You should enjoy working in a ",
        "constantly evolving environment with changing priorities, be passionate about using new ",
        "technologies to solve real problems and to improve the state of intelligent assistants. ",
        "Key Qualifications 3-5 years of experience with scalable machine learning technologies ",
        "Machine learning knowledge and experience in areas such as speech recognition is highly ",
        "desired Industry experience in product development and deployment and understanding of ",
        "full software product life cycle Experience with machine learning frameworks like ",
        "Tensorflow, PyTorch Familiarity with large-scale data processing and distributed systems ",
        "Proficiency in programming languages including but not limited to C/C++/Python Outstanding ",
        "written and verbal communication, with the ability to work well in multi-functional teams ",
        "Description You will be part of a team that is responsible for developing and integrating ",
        "speech and audio experience in a full range devices. Your focus will be to continuously ",
        "improve the invocation experience of our voice assistant on all our devices across the ",
        "globe. You will collaborate with researchers to develop advanced machine learning (ML) ",
        "technologies and agile deployment processes which are easier to scale using the best ",
        "automation practices. This position requires passion for improving the ML training and ",
        "evaluation infrastructure for improved research efficiency, and faster modeling ",
        "iterations. You will work with the speech, audio hardware and software engineering teams ",
        "to deliver a great speech user experience. You must have a 'make this happen' attitude ",
        "and willingness to also work hands-on in building tools, testing, data collection, ",
        "running experiments as well as work with state-of-the-art speech and audio processing ",
        "algorithms. You should thrive in a fast paced environment with rapidly changing ",
        "priorities, and collaborate well with other engineering teams. Education & Experience MS ",
        "in Computer Science, Electrical Engineering or related field Additional Requirements"],
      "jobLink":"#",
      "jobTitle":"AI/ML Machine Learning Engineer",
      "salary":"No salary estimation",
      "skills":[
        "C",
        "C++",
        "Python"
      ]
    }, 
    {
      "companyLocation":"Los Angeles, CA",
      "companyName":"Example Company 3",
      "jobDescriptionArr":[
        "About Example Company 3 is helping to drive mainstream adoption of digital assets by ",
        "connecting the consumer, enterprise, and government tax and accounting ecosystems. Our ",
        "Software-as-a-Service (SaaS) platform streamlines our customers' reporting experience ",
        "across traditional and digital asset classes. We are trusted by thousands of consumers, ",
        "leading exchanges and enterprises, government agencies—including the IRS— respected ",
        "accounting firms, and others to solve complex accounting problems at scale and ensure ",
        "compliance with the latest tax laws. Our team is located in Salt Lake City, ",
        "San Francisco, Seattle and Washington, D.C. If you're searching for a company that's ",
        "dedicated to your growth, recognizes your unique contribution, and provides a fun, ",
        "flexible, and inclusive work environment, then Example Company 3 is the place for you. ",
        "We're looking for team members who are ready to join a hypergrowth company and excited to ",
        "work at the forefront of an entirely new industry.The Role The DevOps engineer is an ",
        "integral part of the growing DevOps organization of TaxBit, Inc. This position plays a ",
        "pivotal role in the design, development, implementation, and maintenance of ",
        "the infrastructure and deployment of TaxBit's application portfolio and services. The ",
        "DevOps engineer partners with Engineering teams to ensure they follow CI/CI and ",
        "Infra-as-code best practices.As a Principal engineer at TaxBit, you should be passionate ",
        "about building high quality software. You are comfortable working autonomously and eager ",
        "to collaborate with teams. You are looking to gain experience in multiple parts of the ",
        "stack and innovate with new technologies in order to create high quality experiences for ",
        "our customers and clients.You will help to implement software solutions in an effort to ",
        "deliver amazing experiences and capabilities for our customers and clients. The ideal ",
        "engineer is someone who is humble, eager to learn, smart and dives into problems. They ",
        "will be one who can inspire others, communicate clearly, and ensure that our clients have ",
        "the best experience possible.Key ResponsibilitiesHelp us design and implement an ",
        "active-active cloud infrastructure that can scale with our tremendous growthHelp us ",
        "automate environment creation using infra-as-codeCreate alerts and dashboards to provide ",
        "visibility into the health of our systemsHelp our services maintain 4 9s of uptime that ",
        "are also performantRequired Qualifications10+ years experience building, provisioning, ",
        "and operating highly-available and complex services in AWS, GCP, or Azure ",
        "(preferably AWS)5+ years of programming experience (Node.js or Python preferred)Solid ",
        "working knowledge of Linux and an expert with bashDemonstrable experience of using Docker ",
        "and general containerizationAdvanced experience creating Infrastructure as Code (IaC) ",
        "(Terraform, Cloud Formation, Serverless, SAM)Experience setting up CI/CD pipelines and ",
        "processesExperience with observability monitoring tools (Datadog, New Relic, Grafana, ",
        "Cloudwatch, etc.)Experience with config management tools such as Ansible or Saltstack",
        "Experience administering databases (DynamoDB, Postgresql, MySQL, etc.)Comfortable being ",
        "in an on-call rotationFamiliarity with cloud security best practices to ensure our data ",
        "remains secureDesired SkillsAWS Certificates - Associate or ProfessionalA keen interest ",
        "in automating all aspects of your jobCircleCI experienceServerless stack experience (API ",
        "GW, Lambda, DynamoDB)Why you want to work hereCompetitive cash and equity compensation",
        "Investment in your physical and mental well-being with a robust offering of health, ",
        "dental, and vision benefits with certain plans eligible for 100% premium coverageA modern ",
        "401(k) plan that includes access to crypto, financial wellness benefits, low fees, and ",
        "moreUnlimited PTO - take time away to rest, refuel, and rechargePaid parental leave to ",
        "bond with your new childFriday team lunchesAutonomous work and flexibility in how work is ",
        "performed"],
      "jobLink":"#",
      "jobTitle":"Principal DevOps Engineer",
      "salary":"Estimated $138K-$175K a year",
      "skills":[
        "Python",
        "MySQL"
      ]
    }
  ]
}
