{
 "jobs": [
   { "companyLocation": "Hybrid remote in San Francisco, CA 94118", "companyName": "Example company", "jobDescription": "WHO IS KINSHIP?  Kinship is here to help everyone pet parent like a pro. We're building the future of pet care, combining insights, products, and services to help people be the best pet parents they can be - and to ultimately create a better world for pets. Kinship is a business division of Mars Petcare, the global leader in pet health, nutrition, and services, and dedicated to one purpose: A Better World for Pets. Learn more at www.kinship.co.  OUR FAMILY OF BRANDS  Adopt-a-Pet the destination for finding homes for homeless pets; we help animal shelters, humane societies, SPCAs, pet rescue groups, and pet adoption agencies connect their homeless pets to millions of adopters a month Wisdom Panel our world-leading genetic health screening and DNA testing for dogs Whistle the award-winning GPS dog tracker and health monitor Pet Insight Project our ground-breaking science team that uses AI to turn billions of data points into actionable insights Vet Insight our expert-driven, on-demand pet health platform The Wildest the destination that helps pet parents keep their cool in the wild world of pet parenting GoodFriend a marketplace for all your pet's people, connecting pet owners with their people, from groomers, trainers, to veterinarians and experts PetExec is here to help organizations of all sizes in managing their daycare, boarding, grooming, and training operations  Together, these teams work to set new standards in pet care. And, as a part of Mars Petcare, they work to create a better world for pets. Learn more at www.kinship.co.   OUR TEAM  PetExec is the industry leading SaaS platform for pet boarding and daycare. We are looking for a great developer to work with us as we take PetExec to the next level. As part of the PetExec engineering team, you will join a group that cares about writing clean code, collaborating, taking ownership of their work, and being open-minded to learning new technologies. Your ideas, design and code will make a real difference in the growing field of pet care technology. This is an exciting time to join Kinship as we scale out our products and create the pet care platform of the future.  We are looking for a great developer who is proficient with React.js and React Native. Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows (such as Flux or Redux). You will ensure that these components and the overall application are robust, testable and easy to maintain. You will coordinate with the rest of the team working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and quality product is important.  RESPONSIBILITIES:  Developing new user-facing features using React.js Building reusable components and front-end libraries for future use Translating designs and wireframes into high quality code Optimizing components for maximum performance across a vast array of web-capable devices and browsers Integrate with RESTful APIs  THE PRO WE'RE LOOKING FOR  As Kinship people, we have three pillars that set out how we aim to be-in our everyday work, and in how we approach each other. We call these our Cultural Pillars. In all of the roles that we hire for, we look for people who are Optimistic, Purposefully Inquisitive, and Open to All. And for this role, you'll need these skills to knock it out of the dog park:  TECHNICAL SKILLS:  HTML/CSS - Need a strong background on how to style websites. Familiar with Bootstrap. Knowing a preprocessor such as Sass is a plus Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model Thorough understanding of React.js and its core principles Experience with building PHP based web applications Knowledge on how to integrate with RESTful APIs Ability to mock up designs with tools such as Figma, Sketch, etc. Able to convert the mock ups into code Knowledge on OAuth2 authentication and authorization Familiarity with code versioning tools such as Git Experience with common development tools such as Node, Yarn, NPM, etc. Ability to create testable components Standard understanding on relational databases, especially PostgreSQL  LEADERSHIP COMPETENCIES:  You Have Courage: a willingness to bring forth a new idea, engaging others across Kinship to support you, and taking risks and action will full accountability You Learn at Pace: a consistent and fast work ethic to meet growth goals, and the ability to evolve and pivot quickly from what you've learned You Value Difference: a genuine belief in inclusion and diversity is in your DNA, and it shows up in your work, and how you work.  WHAT YOU CAN EXPECT FROM US:  Opportunities to impact and grow the business on a day to day basis Dog-friendly workplaces Medical, dental, vision, 401k match, and pet benefits for Full-Time Employees and their families Unlimited paid time off for Full-Time Employees Hybrid work environment Parental leave for the birth or adoption of your new human child (and fur baby) for Full-Time Employees Discounts on pet products, services, nutrition and veterinary wellness plans An extensive onboarding program with a chance to meet all of our leaders across Kinship    Disclaimer: Kinship is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request.  Note to Search Firms/Agencies: Kinship does not compensate search firms for unsolicited assistance unless they have a written search agreement with Kinship and the requisition is position-specific. Any resumes, curriculum vitae, and other unsolicited assistance from search firms that do not have a written search agreement or position-specific requisition submitted to any Associate of Kinship will be deemed the sole property of Kinship and no fee will be paid in the event the candidate is hired by Kinship.", "jobLink": "#", "salary": "$150,000 - $180,000 a year", "skills": ["JavaScript", "PHP", "HTML", "React"] },
   { "title": "Title 2", "content": "Content 2" },
   { "title": "Title 3", "content": "Content 3" }
 ]
}
